// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 5 2 6 7
// Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка

int[,] CreateMatrixRndInt(int rows, int colunns, int min, int max)
{
    int[,] matrix = new int[rows, colunns];
    Random rnd = new Random();
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            matrix[i, j] = rnd.Next(min, max + 1);
        }
    }
    return matrix;
}

void PrintArray(int[,] matr)
{
    for (int i = 0; i < matr.GetLength(0); i++)
    {
        Console.Write("|");
        for (int j = 0; j < matr.GetLength(1); j++)
        {
            Console.Write($"{matr[i, j],6}");
        }
        Console.WriteLine(" |");
    }
}

int RowSmallestSum(int[,] matrix)
{
    int[] arraySum = new int[matrix.GetLength(0)];
    for (int i = 0; i < matrix.GetLength(0); i++)
    {
        int sum = 0;
        for (int j = 0; j < matrix.GetLength(1); j++)
        {
            sum += matrix[i, j];
        }
        arraySum[i] = sum;
    }
    int indexMin = 0;
    for (int k = 1; k < arraySum.Length; k++)
    {
        if (arraySum[k] < arraySum[indexMin]) indexMin = k;
    }
    return indexMin + 1;
}

int[,] MatrixRndInt = CreateMatrixRndInt(3, 4, 1, 9);
PrintArray(MatrixRndInt);
int rowSmallestSum = RowSmallestSum(MatrixRndInt);
Console.WriteLine($"{rowSmallestSum} строка с наименьшей суммой.");